src/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ExchangePlan>
		<Properties>
			<Name>ИнтеграцияСМагазинамиСоцСетей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МагазинДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МагазиныСоцСетейДляИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончанияДействияТокенаДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьИзмененияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатурыСтарая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиДатыДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоФотографийДляКарточки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыгрузкиХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыгрузкиХарактеристикДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНабораВариантов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьФайлыХарактеристикиИзНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбмениватьсяСтатусамиЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаАвторизацииСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончанияДействияТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПодборкиТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьВходящиеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСкрытуюКопиюВПоддержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаказаПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СлужбыДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужбаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СлужбыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СостояниеНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСтраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаСобытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлектроннаяПочта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Капча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/InformationRegisters/НоменклатураХарактеристикДляМагазинаСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураХарактеристикДляМагазинаСоцСетей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВиртуальныйКаталог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеКаталогиТоваровМагазиновСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей/Forms/ФормаНаполненияВиртуальныхКаталогов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаУзелОбмена = Параметры.СсылкаНаУзелОбмена;
	
	ОбновитьВыбранныеНаСервере();
	ОбновитьВиртуальныеКаталогиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы 

&НаКлиенте
Процедура Перенести1ВВыгрузку(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоВыбранныхТоваров.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоВиртуальныхКаталогов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите хотя бы 1 категорию Магазина ВКонтакте для выгрузки!",,"ДекорацияСписокВыбранныхГрупп","ЭтаФорма");
		Возврат;
	КонецЕсли;
	
	ВыбраннаяКатегория = ТекущиеДанные.Идентификатор;
	
	МассивВыбранныхЭлементов = Новый Массив;
	Для Каждого СтрИндекс Из ВыделенныеСтроки Цикл 
		ТекущаяСтрока = ДеревоВыбранныхТоваров.НайтиПоИдентификатору(СтрИндекс);
		МассивВыбранныхЭлементов.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	ПеренестиВВыгрузку(ВыбраннаяКатегория, МассивВыбранныхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить1ИзВыгрузки(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоВиртуальныхКаталогов.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивВыбранныхЭлементов = Новый Массив;
	Для Каждого СтрИндекс Из ВыделенныеСтроки Цикл
		ТекущаяСтрока = ДеревоВиртуальныхКаталогов.НайтиПоИдентификатору(СтрИндекс);
		МассивВыбранныхЭлементов.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	УдалитьИзВыгрузки(МассивВыбранныхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборкиЗавершение", ЭтаФорма);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", СсылкаНаУзелОбмена);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Форма.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	МассивКаталогов = ПолучитьМассивИспользуемыхКаталогов(СсылкаНаУзелОбмена);
	
	Если ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Количество() Тогда
		
		МассивИспользуемых = Новый Массив;
		Для Каждого СтрОписание Из МассивКаталогов Цикл
			МассивИспользуемых.Добавить(СтрОписание.Идентификатор);
		КонецЦикла;
		
		МассивВыбранных = Новый Массив;
		МассивДляУдаления = Новый Массив;
		Для Каждого Стр Из ДеревоВиртуальныхКаталогов.ПолучитьЭлементы() Цикл
			Если МассивИспользуемых.Найти(Стр.Идентификатор) = Неопределено Тогда
				МассивДляУдаления.Добавить(Стр);
			КонецЕсли;
			
			МассивВыбранных.Добавить(Стр.Идентификатор);
			
		КонецЦикла;
		
		Для Каждого Стр Из МассивДляУдаления Цикл
			ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Удалить(Стр);
		КонецЦикла;
		
		Для Каждого СтрОписание Из МассивКаталогов Цикл
			Если МассивВыбранных.Найти(СтрОписание.Идентификатор) = Неопределено Тогда
				НовСтр = ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрОписание);
				НовСтр.НомерКартинки = 99;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для Каждого СтрОписание Из МассивКаталогов Цикл
			НовСтр = ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрОписание);
			НовСтр.НомерКартинки = 99;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВиртуальныхКаталоговПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Строка = Неопределено Тогда
		
		КоличествоКатегорий = ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Количество();
		
		Если КоличествоКатегорий = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите хотя бы 1 категорию Магазина ВКонтакте для выгрузки!",,"ДекорацияСписокВыбранныхГрупп","ЭтаФорма");
			Возврат;
		Иначе
			ТекущаяСтрока = ДеревоВиртуальныхКаталогов.ПолучитьЭлементы()[КоличествоКатегорий-1];
		КонецЕсли;
		
	Иначе
		ТекущаяСтрока = ДеревоВиртуальныхКаталогов.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	ПеренестиВВыгрузку(ТекущаяСтрока.Идентификатор, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВиртуальныхКаталоговПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВиртуальныхКаталоговНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элементы.ДеревоВиртуальныхКаталогов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Выполнение = Ложь;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите хотя бы 1 подборку Магазина ВКонтакте для выгрузки!");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВыбранныеНаСервере()
	
	ДеревоВыбранныхТоваров.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""123456"" КАК Идентификатор,
	|	НоменклатураХарактеристикДляМагазинаСоцСетей.Сортировка КАК Сортировка,
	|	НоменклатураХарактеристикДляМагазинаСоцСетей.Номенклатура КАК Номенклатура,
	|	НоменклатураХарактеристикДляМагазинаСоцСетей.Характеристика КАК Характеристика,
	|	""Товары к выгрузке"" КАК Наименование
	|ИЗ
	|	РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетей КАК НоменклатураХарактеристикДляМагазинаСоцСетей
	|ГДЕ
	|	НоменклатураХарактеристикДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка
	|ИТОГИ
	|	МАКСИМУМ(Наименование)
	|ПО
	|	Идентификатор,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", СсылкаНаУзелОбмена);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписиКатегории = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДетальныеЗаписиКатегории.Следующий() Цикл
		
		СтрокаКатегория = ДеревоВыбранныхТоваров.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКатегория, ВыборкаДетальныеЗаписиКатегории);
		СтрокаКатегория.Наименование = ВыборкаДетальныеЗаписиКатегории.Наименование;
		СтрокаКатегория.НомерКартинки = 99;
		
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписиКатегории.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			СтрокаНоменклатура = СтрокаКатегория.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНоменклатура, ВыборкаДетальныеЗаписиНоменклатура);
			СтрокаНоменклатура.Наименование = ВыборкаДетальныеЗаписиНоменклатура.Номенклатура;
			СтрокаНоменклатура.НомерКартинки = 0;
			
			ВыборкаДетальныеЗаписиХарактеристика = ВыборкаДетальныеЗаписиНоменклатура.Выбрать();
			Пока ВыборкаДетальныеЗаписиХарактеристика.Следующий() Цикл
				
				Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписиХарактеристика.Характеристика) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаХарактеристика = СтрокаНоменклатура.ПолучитьЭлементы().Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаХарактеристика, ВыборкаДетальныеЗаписиХарактеристика);
				СтрокаХарактеристика.Наименование = ВыборкаДетальныеЗаписиХарактеристика.Характеристика;
				СтрокаХарактеристика.НомерКартинки = 0;
				СтрокаНоменклатура.НомерКартинки = 1;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВиртуальныеКаталогиНаСервере()
	
	ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Ссылка КАК Идентификатор,
	|	НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.Номенклатура КАК Номенклатура,
	|	НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.Характеристика КАК Характеристика,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Наименование КАК Наименование,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ЭтоОсновной КАК ЭтоОсновной,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ЭтоСкрытый КАК ЭтоСкрытый
	|ИЗ
	|	Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетей КАК ВиртуальныеКаталогиТоваровМагазиновСоцСетей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги КАК НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги
	|		ПО (НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.ВиртуальныйКаталог = ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Ссылка)
	|ГДЕ
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Владелец = &УзелИнформационнойБазы
	|	И НЕ ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоОсновной УБЫВ,
	|	ЭтоСкрытый,
	|	Наименование,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(ЭтоОсновной),
	|	МАКСИМУМ(ЭтоСкрытый)
	|ПО
	|	Идентификатор,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", СсылкаНаУзелОбмена);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписиКатегории = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДетальныеЗаписиКатегории.Следующий() Цикл
		
		СтрокаКатегория = ДеревоВиртуальныхКаталогов.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКатегория, ВыборкаДетальныеЗаписиКатегории);
		СтрокаКатегория.Наименование = ВыборкаДетальныеЗаписиКатегории.Наименование;
		СтрокаКатегория.НомерКартинки = 99;
		
		ВыборкаДетальныеЗаписиНоменклатура = ВыборкаДетальныеЗаписиКатегории.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДетальныеЗаписиНоменклатура.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписиНоменклатура.Номенклатура) Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаНоменклатура = СтрокаКатегория.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНоменклатура, ВыборкаДетальныеЗаписиНоменклатура);
			СтрокаНоменклатура.Наименование = ВыборкаДетальныеЗаписиНоменклатура.Номенклатура;
			СтрокаНоменклатура.НомерКартинки = 0;
			СтрокаНоменклатура.ЭтоОсновной = Ложь;
			СтрокаНоменклатура.ЭтоСкрытый = ВыборкаДетальныеЗаписиНоменклатура.ЭтоСкрытый;
			
			ВыборкаДетальныеЗаписиХарактеристика = ВыборкаДетальныеЗаписиНоменклатура.Выбрать();
			Пока ВыборкаДетальныеЗаписиХарактеристика.Следующий() Цикл
				
				Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписиХарактеристика.Характеристика) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаХарактеристика = СтрокаНоменклатура.ПолучитьЭлементы().Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаХарактеристика, ВыборкаДетальныеЗаписиХарактеристика);
				СтрокаХарактеристика.Наименование = ВыборкаДетальныеЗаписиХарактеристика.Характеристика;
				СтрокаХарактеристика.НомерКартинки = 0;
				СтрокаХарактеристика.ЭтоОсновной = Ложь;
				СтрокаХарактеристика.ЭтоСкрытый = ВыборкаДетальныеЗаписиХарактеристика.ЭтоСкрытый;
				СтрокаНоменклатура.НомерКартинки = 1;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВВыгрузку(ВыбраннаяКатегория, МассивВыбранныхЭлементов)
	
	Для Каждого ТекущаяСтрока Из МассивВыбранныхЭлементов Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) Тогда
			НайтиДобавитьХарактеристику(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика, ВыбраннаяКатегория);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			
			НайтиДобавитьНоменклатуру(ТекущаяСтрока.Номенклатура, ВыбраннаяКатегория);
			
			Для Каждого СтрокаХарактеристика Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
				НайтиДобавитьХарактеристику(СтрокаХарактеристика.Номенклатура, СтрокаХарактеристика.Характеристика, ВыбраннаяКатегория);
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		МассивСтрок = Новый Массив;
		РекурсивноПолучитьМассивСтрок(ТекущаяСтрока, МассивСтрок); 
		
		Для Каждого Стр Из МассивСтрок Цикл
			Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
				
				НайтиДобавитьНоменклатуру(Стр.Номенклатура, ВыбраннаяКатегория);
				
				Для Каждого СтрокаХарактеристика Из Стр.ПолучитьЭлементы() Цикл
					НайтиДобавитьХарактеристику(СтрокаХарактеристика.Номенклатура, СтрокаХарактеристика.Характеристика, ВыбраннаяКатегория);
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РекурсивноПолучитьМассивСтрок(СтрокаРодитель,МассивСтрок)
	
	Для Каждого ТекущаяСтрока Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			МассивСтрок.Добавить(ТекущаяСтрока);
		Иначе
			РекурсивноПолучитьМассивСтрок(ТекущаяСтрока,МассивСтрок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДобавитьНоменклатуру(Номенклатура, ВыбраннаяКатегория)
	
	СтрокаКатегория = Неопределено;
	ЕстьВхождение = Ложь;
	Для Каждого СтрКатегория Из ДеревоВиртуальныхКаталогов.ПолучитьЭлементы() Цикл
		
		Если СтрКатегория.Идентификатор <> ВыбраннаяКатегория Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаКатегория = СтрКатегория;
		
		Для Каждого СтрНоменклатура Из СтрКатегория.ПолучитьЭлементы() Цикл
			
			Если СтрНоменклатура.Номенклатура = Номенклатура Тогда
				ЕстьВхождение = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьВхождение Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаКатегория = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНоменклатуры = СтрокаКатегория.ПолучитьЭлементы().Добавить();
	СтрокаНоменклатуры.Идентификатор = ВыбраннаяКатегория;
	СтрокаНоменклатуры.Номенклатура = Номенклатура;
	СтрокаНоменклатуры.Наименование = Номенклатура;
	СтрокаНоменклатуры.НомерКартинки = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДобавитьХарактеристику(Номенклатура, Характеристика, ВыбраннаяКатегория)
	
	СтрокаКатегория = Неопределено;
	СтрокаНоменклатуры = Неопределено;
	ЕстьВхождение = Ложь;
	Для Каждого СтрКатегория Из ДеревоВиртуальныхКаталогов.ПолучитьЭлементы() Цикл
		
		Если СтрКатегория.Идентификатор <> ВыбраннаяКатегория Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаКатегория = СтрКатегория;
		
		Для Каждого СтрНоменклатура Из СтрКатегория.ПолучитьЭлементы() Цикл
			
			Если СтрНоменклатура.Номенклатура <> Номенклатура Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаНоменклатуры = СтрНоменклатура;
			
			Для Каждого СтрХарактеристика Из СтрНоменклатура.ПолучитьЭлементы() Цикл
				Если СтрХарактеристика.Характеристика = Характеристика Тогда
					ЕстьВхождение = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьВхождение Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаКатегория = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаНоменклатуры = Неопределено Тогда
		СтрокаНоменклатуры = СтрокаКатегория.ПолучитьЭлементы().Добавить();
		СтрокаНоменклатуры.Идентификатор = ВыбраннаяКатегория;
		СтрокаНоменклатуры.Номенклатура = Номенклатура;
		СтрокаНоменклатуры.Наименование = Номенклатура;
		СтрокаНоменклатуры.НомерКартинки = 1;
	КонецЕсли;
	
	СтрокаНоменклатуры.НомерКартинки = 1;
	СтрокаХарактеристика = СтрокаНоменклатуры.ПолучитьЭлементы().Добавить();
	СтрокаХарактеристика.Идентификатор = ВыбраннаяКатегория;
	СтрокаХарактеристика.Номенклатура = Номенклатура;
	СтрокаХарактеристика.Характеристика = Характеристика;
	СтрокаХарактеристика.Наименование = Характеристика;
	СтрокаХарактеристика.НомерКартинки = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзВыгрузки(МассивВыбранныхЭлементов)
	
	Для Каждого ТекущаяСтрока Из МассивВыбранныхЭлементов Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) 
			Или ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			
			СтрокаРодителя = ТекущаяСтрока.ПолучитьРодителя();
			СтрокаРодителя.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
		Иначе
			ТекущаяСтрока.ПолучитьЭлементы().Очистить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()

	НЗ = РегистрыСведений.НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.СоздатьНаборЗаписей();
	НЗ.Отбор.УзелИнформационнойБазы.Установить(СсылкаНаУзелОбмена);
	
	Сортировка = 0;
	
	Для Каждого СтрКатегория Из ДеревоВиртуальныхКаталогов.ПолучитьЭлементы() Цикл
		Для Каждого СтрНоменклатура Из СтрКатегория.ПолучитьЭлементы() Цикл
			
			Если СтрНоменклатура.ПолучитьЭлементы().Количество() Тогда
				
				Для Каждого СтрХарактеристика Из СтрНоменклатура.ПолучитьЭлементы() Цикл
					
					НовЗап = НЗ.Добавить();
					НовЗап.ВиртуальныйКаталог = СтрКатегория.Идентификатор;
					НовЗап.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
					НовЗап.Номенклатура = СтрХарактеристика.Номенклатура;
					НовЗап.Характеристика = СтрХарактеристика.Характеристика;
					
				КонецЦикла;
				
			Иначе
				
				НовЗап = НЗ.Добавить();
				НовЗап.ВиртуальныйКаталог = СтрКатегория.Идентификатор;
				НовЗап.УзелИнформационнойБазы = СсылкаНаУзелОбмена;
				НовЗап.Номенклатура = СтрНоменклатура.Номенклатура;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ПолучитьМассивИспользуемыхКаталогов(СсылкаНаУзелОбмена)
	
	МассивИспользуемыхВМагазине = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Ссылка КАК Ссылка,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Наименование КАК Наименование,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ЭтоОсновной КАК ЭтоОсновной,
	|	ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ЭтоСкрытый КАК ЭтоСкрытый
	|ИЗ
	|	Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетей КАК ВиртуальныеКаталогиТоваровМагазиновСоцСетей
	|ГДЕ
	|	НЕ ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ПометкаУдаления
	|	И ВиртуальныеКаталогиТоваровМагазиновСоцСетей.Владелец = &СсылкаНаУзелОбмена";
	
	Запрос.УстановитьПараметр("СсылкаНаУзелОбмена", СсылкаНаУзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Описание = Новый Структура;
		Описание.Вставить("Идентификатор" , ВыборкаДетальныеЗаписи.Ссылка);
		Описание.Вставить("Наименование" , ВыборкаДетальныеЗаписи.Наименование);
		Описание.Вставить("ЭтоОсновной" , ВыборкаДетальныеЗаписи.ЭтоОсновной);
		Описание.Вставить("ЭтоСкрытый" , ВыборкаДетальныеЗаписи.ЭтоСкрытый);
		МассивИспользуемыхВМагазине.Добавить(Описание);
	КонецЦикла;
	
	Возврат МассивИспользуемыхВМагазине;
	
КонецФункции

#КонецОбласти
